# running in cover/src/
read -formal TileAndMemTop.sv
read -formal SignalTracker.sv
prep -top TileAndMemTop

hierarchy -simcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
